//---------------------------------------------------------------------------------------------------------------
//
//
// [ 入門 ] hello world
// 
// ※ 画面に hello world の文字が出力されるだけのサンプルです
//
//---------------------------------------------------------------------------------------------------------------
#include <time.h>
#include <string>
#include "../dxlib_ext/dxlib_ext.h"
#include "gm_main.h"


std::list<int> datas;


//------------------------------------------------------------------------------------------------------------
// ゲーム起動時に１度だけ実行されます
void gameStart()
{
    datas.emplace_back(0);
    datas.emplace_back(1);
    datas.emplace_back(15);
    datas.emplace_back(30);
    datas.emplace_back(60);

    std::list<int>::iterator it = datas.begin();
    while (it != datas.end())
    {
        if (*it == 30)
        {
            it = datas.erase(it);
            continue;
        }
        it++;
    }
}

//------------------------------------------------------------------------------------------------------------
// 毎フレーム実行されます
void gameMain(float delta_time)
{
    int y = 20;
    for (auto t : datas)
    {
        DrawStringEx(0, y, -1, "%d", t);
        y += 20;
    }
}

//------------------------------------------------------------------------------------------------------------
// ゲーム終了時に１度だけ実行されます
void gameEnd()
{
}
